; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_3 type_2)
 (:predicates (pred_4 ?v6 - type_3 ?v4 - type_1)
 	      (pred_2 ?v3 - object ?v4 - type_1)
	      (pred_1 ?v6 - type_3 ?v1 - type_2)
	      (pred_3 ?v6 - type_3 ?v3 - object ?v1 - type_2))

   (:action op_1
       :parameters  (?v6 - type_3 ?v7 ?v8 - type_1)
       :precondition (and  (pred_4 ?v6 ?v7))
       :effect (and  (pred_4 ?v6 ?v8)
		     (not (pred_4 ?v6 ?v7))))

   (:action op_3
       :parameters (?v6 - type_3 ?v2 - object ?v5 - type_1 ?v1 - type_2)
       :precondition  (and  (pred_2 ?v2 ?v5) (pred_4 ?v6 ?v5) (pred_1 ?v6 ?v1))
       :effect (and (pred_3 ?v6 ?v2 ?v1)
		    (not (pred_2 ?v2 ?v5)) 
		    (not (pred_1 ?v6 ?v1))))

   (:action op_2
       :parameters (?v6 - type_3 ?v2 - object ?v5 - type_1 ?v1 - type_2)
       :precondition  (and  (pred_3 ?v6 ?v2 ?v1) (pred_4 ?v6 ?v5))
       :effect (and (pred_2 ?v2 ?v5)
		    (pred_1 ?v6 ?v1)
		    (not (pred_3 ?v6 ?v2 ?v1)))))

; problem
(define (problem gripper-2-3-3)
(:domain gripper-strips)
(:objects obj_03 obj_04 - type_3
obj_08 obj_07 obj_01 obj_06 - type_2
obj_10 obj_12 obj_05 - type_1
obj_11 obj_02 obj_09 - object)
(:init
(pred_4 obj_03 obj_05)
(pred_1 obj_03 obj_08)
(pred_1 obj_03 obj_07)
(pred_4 obj_04 obj_12)
(pred_1 obj_04 obj_01)
(pred_1 obj_04 obj_06)
(pred_2 obj_11 obj_05)
(pred_2 obj_02 obj_10)
(pred_2 obj_09 obj_05)
)
(:goal
(and
(pred_2 obj_11 obj_10)
(pred_2 obj_02 obj_12)
(pred_2 obj_09 obj_10)
)
)

(:constraints
  (and
    (always (not (and (pred_4 obj_03 obj_10) (pred_4 obj_04 obj_10))))
  )
)
)

; plan
1. (op_3 obj_03 obj_11 obj_05 obj_07)
   deleted: (pred_2 obj_11 obj_05) (pred_1 obj_03 obj_07)
   added: (pred_3 obj_03 obj_11 obj_07)
   goals met: 0 of 3
2. (op_3 obj_03 obj_09 obj_05 obj_08)
   deleted: (pred_2 obj_09 obj_05) (pred_1 obj_03 obj_08)
   added: (pred_3 obj_03 obj_09 obj_08)
   goals met: 0 of 3
3. (op_1 obj_03 obj_05 obj_10)
   deleted: (pred_4 obj_03 obj_05)
   added: (pred_4 obj_03 obj_10)
   goals met: 0 of 3
4. (op_2 obj_03 obj_11 obj_10 obj_07)
   deleted: (pred_3 obj_03 obj_11 obj_07)
   added: (pred_2 obj_11 obj_10) (pred_1 obj_03 obj_07)
   goals met: 1 of 3
5. (op_2 obj_03 obj_09 obj_10 obj_08)
   deleted: (pred_3 obj_03 obj_09 obj_08)
   added: (pred_2 obj_09 obj_10) (pred_1 obj_03 obj_08)
   goals met: 2 of 3
6. (op_3 obj_03 obj_02 obj_10 obj_07)
   deleted: (pred_2 obj_02 obj_10) (pred_1 obj_03 obj_07)
   added: (pred_3 obj_03 obj_02 obj_07)
   goals met: 2 of 3
7. (op_1 obj_03 obj_10 obj_12)
   deleted: (pred_4 obj_03 obj_10)
   added: (pred_4 obj_03 obj_12)
   goals met: 2 of 3
8. (op_2 obj_03 obj_02 obj_12 obj_07)
   deleted: (pred_3 obj_03 obj_02 obj_07)
   added: (pred_2 obj_02 obj_12) (pred_1 obj_03 obj_07)
   goals met: 3 of 3
